Debjit230/ESP8266-EXPERIMENT/src/main.cpp
#include <Arduino.h>
#include <ESP8266WiFi.h>
#include <ESP8266WebServer.h>
#include <EEPROM.h>
#include <Wire.h>
#include <Adafruit_GFX.h>
#include <Adafruit_SSD1306.h>
#include <IRremoteESP8266.h>
#include <IRrecv.h>
#include <IRutils.h>
#include <time.h>

extern "C" {
  #include "user_interface.h"
}

#define SCREEN_WIDTH 128
#define SCREEN_HEIGHT 64
#define OLED_RESET    -1
Adafruit_SSD1306 display(SCREEN_WIDTH, SCREEN_HEIGHT, &Wire, OLED_RESET);

// Hardware Pin Definitions
#define OLED_SDA      D3
#define OLED_SCL      D4
#define IR_RECV_PIN   D2
#define BUTTON_PIN    D5

// Indicator LEDs Configuration
#define EXTERNAL_LED  D1
#define BOARD_LED     D0

// AP Config Portal Hotspot Credentials
const char* AP_CONFIG_SSID = "COCO-Desk-Buddy";
const char* AP_CONFIG_PASS = "12345678";

// EEPROM Storage Settings
#define EEPROM_SIZE 256
#define EEPROM_MAGIC 0x5A
#define EEPROM_BRIGHT_ADDR          97
#define EEPROM_AUTODIM_ADDR         98
#define EEPROM_AUTOLOCK_EN_ADDR     99
#define EEPROM_AUTOLOCK_SEC_ADDR    100
#define EEPROM_WISH_ARMED_ADDR      101
#define EEPROM_WISH_DATE_ADDR       102
#define EEPROM_WISH_TEXT_ADDR       110
#define EEPROM_GOOD_MORNING_EN_ADDR 120
#define EEPROM_GOOD_NIGHT_EN_ADDR   121

char target_ssid[33]     = "";
char target_password[65] = "";
uint8_t userBrightness   = 255;
bool autoDimEnabled      = false;
bool autoLockEnabled     = true;
uint16_t autoLockSeconds = 60;

// Daily Routine Toggles
bool goodMorningEnabled  = true;
bool goodNightEnabled    = true;
int lastMorningTriggerDay = -1;
int lastNightTriggerDay   = -1;

// Scheduled Wish Calendar Storage (Matches OLED screen clock)
struct WishTimeSchedule {
  uint16_t year;
  uint8_t  month;
  uint8_t  day;
  uint8_t  hour;
  uint8_t  minute;
  bool     armed;
};

WishTimeSchedule wishTarget = {0, 0, 0, 0, 0, false};
char scheduledSmsText[64]   = "Happy Birthday!";
bool isSmsAlertActive       = false;
unsigned long smsAlertStartTime = 0;
const unsigned long SMS_DISPLAY_DURATION = 30000; // 30 seconds

// Type of active alert: 0 = Birthday/Custom, 1 = Good Morning, 2 = Good Night
uint8_t activeAlertType = 0;

// Marquee Text State
int marqueeScrollX = 128;
unsigned long lastMarqueeShift = 0;

ESP8266WebServer server(80);

// NTP Time Configuration (IST: UTC +5:30 = 19800 seconds)
const long  gmtOffset_sec     = 19800;
const int   daylightOffset_sec = 0;
const char* ntpServer         = "pool.ntp.org";

// Timers & Lock Settings
const unsigned long CLOCK_TIMEOUT_MS = 20000;
unsigned long lastUserActivity       = 0;
bool isClockModeActive               = false;
bool isDeviceLocked                  = false;

// Peek Clock
bool isPeekClockActive               = false;
unsigned long peekClockStartTime     = 0;
const unsigned long PEEK_CLOCK_DURATION = 3000;

// Banner Notification
bool isBannerActive                  = false;
unsigned long bannerStartTime        = 0;
const unsigned long BANNER_DURATION  = 1200;

void setOledBrightness(uint8_t contrast) {
  display.ssd1306_command(SSD1306_SETCONTRAST);
  display.ssd1306_command(contrast);
}

// LED Controller
bool alertLedActive = false;
unsigned long alertLedStart = 0;
const unsigned long LED_ALERT_DURATION = 120;

void triggerLedAlert() {
  alertLedActive = true;
  alertLedStart = millis();
  digitalWrite(EXTERNAL_LED, HIGH);
  digitalWrite(BOARD_LED, LOW);
}

void shutoffLeds() {
  digitalWrite(EXTERNAL_LED, LOW);
  digitalWrite(BOARD_LED, HIGH);
}

// Emotion Engine Definitions
enum EmoState {
  EMO_NORMAL,
  EMO_SUSPICIOUS,
  EMO_SHOCKED,
  EMO_WINK,
  EMO_SLEEP,
  EMO_LOVE
};

EmoState currentEmotion = EMO_NORMAL;
unsigned long emotionHoldStartTime = 0;
const unsigned long EMOTION_HOLD_MS = 2500;

void setEmotion(EmoState newEmo) {
  currentEmotion = newEmo;
  emotionHoldStartTime = millis();
}

bool isMorningWindow() {
  time_t tNow = time(nullptr);
  if (tNow < 100000) return false;
  struct tm* timeinfo = localtime(&tNow);
  if (timeinfo->tm_hour == 6) return true;
  if (timeinfo->tm_hour == 7 && timeinfo->tm_min <= 30) return true;
  return false;
}

bool isNightWindow() {
  time_t tNow = time(nullptr);
  if (tNow < 100000) return false;
  struct tm* timeinfo = localtime(&tNow);
  if (timeinfo->tm_hour >= 23 || timeinfo->tm_hour < 6) return true;
  return false;
}

// IR
const uint16_t kCaptureBufferSize = 1024;
const uint8_t kTimeout = 50;
IRrecv irrecv(IR_RECV_PIN, kCaptureBufferSize, kTimeout, true);
decode_results irResults;

String lastProtocol = "Ready";
String lastHexCode  = "Press Remote";
int lastBits        = 0;

// Wi-Fi Radar
#define MAX_TARGETS 8
struct Target {
  uint8_t mac[6];
  int rssi;
  float angle;
  unsigned long lastSeen;
  bool active;
};

Target targets[MAX_TARGETS];
uint8_t currentChannel = 1;
unsigned long lastChannelHop = 0;
unsigned long lastDisplayDraw = 0;
float sweepAngle = 0.0;

struct RxControl {
  signed rssi: 8;
  unsigned rate: 4;
  unsigned is_group: 1;
  unsigned: 1;
  unsigned sig_mode: 2;
  unsigned legacy_length: 12;
  unsigned damatch0: 1;
  unsigned damatch1: 1;
  unsigned bssidmatch0: 1;
  unsigned bssidmatch1: 1;
  unsigned MCS: 7;
  unsigned CWB: 1;
  unsigned HT_length: 16;
  unsigned Smoothing: 1;
  unsigned Not_Sounding: 1;
  unsigned: 1;
  unsigned Aggregation: 1;
  unsigned STBC: 2;
  unsigned FEC_CODING: 1;
  unsigned SGI: 1;
  unsigned rxend_state: 8;
  unsigned ampdu_cnt: 8;
  unsigned channel: 4;
  unsigned: 12;
};

struct SnifferPacket {
  struct RxControl rx_ctrl;
  uint8_t buf[112];
  uint16_t cnt;
  uint16_t len;
};

int totalNetworksFound = 0;
unsigned long lastScanTime = 0;
const unsigned long SCAN_INTERVAL = 5000;
bool scanningInProgress = false;

// Tripwire
const unsigned long SAMPLE_RATE_MS = 50;
const float EMA_ALPHA = 0.08;
float baselineRSSI = 0.0;
bool baselineInitialized = false;
unsigned long lastSampleTime = 0;
unsigned long lastMotionDetected = 0;
const unsigned long ALARM_HOLD_TIME = 1500;
bool isCalibrating = false;
unsigned long calibrationStartTime = 0;
float maxNoiseObserved = 0.0;
float dynamicThreshold = 2.4;

#define WAVE_POINTS 128
int waveBuffer[WAVE_POINTS];
int waveIndex = 0;

enum DeviceMode {
  MODE_RADAR = 0,
  MODE_SCANNER = 1,
  MODE_RF_TRIPWIRE = 2,
  MODE_IR_DECODER = 3,
  MODE_AP_CONFIG = 4
};

DeviceMode currentMode = MODE_RADAR;
DeviceMode resumeMode  = MODE_RADAR;

// Button
unsigned long lastButtonCheck = 0;
bool buttonIsPressed = false;
unsigned long buttonPressStartTime = 0;
bool holdThresholdMet = false;
int clickCount = 0;
unsigned long lastClickTime = 0;
const unsigned long DOUBLE_CLICK_GAP = 350;

