Debjit230/ESP8266-EXPERIMENT/src/main.cpp
// Eyes
float currentEyeX = 0.0;
float currentEyeY = 0.0;
float targetEyeX  = 0.0;
float targetEyeY  = 0.0;
float currentEyeH = 30.0;
float targetEyeH  = 30.0;

unsigned long lastEyeTargetShift = 0;
bool isBlinking = false;
unsigned long blinkStartTime = 0;
int zzzStep = 0;
unsigned long lastZzzAnim = 0;

void enterLockScreen();
void unlockDevice();
void drawEmoFace();

void loadCredentials() {
  EEPROM.begin(EEPROM_SIZE);
  if (EEPROM.read(0) == EEPROM_MAGIC) {
    for (int i = 0; i < 32; i++) target_ssid[i] = EEPROM.read(1 + i);
    target_ssid[32] = '\0';
    for (int i = 0; i < 64; i++) target_password[i] = EEPROM.read(33 + i);
    target_password[64] = '\0';

    uint8_t storedBright = EEPROM.read(EEPROM_BRIGHT_ADDR);
    userBrightness = (storedBright >= 1 && storedBright <= 255) ? storedBright : 255;

    uint8_t storedDim = EEPROM.read(EEPROM_AUTODIM_ADDR);
    autoDimEnabled = (storedDim == 1);

    uint8_t storedLockEn = EEPROM.read(EEPROM_AUTOLOCK_EN_ADDR);
    autoLockEnabled = (storedLockEn != 0);

    uint8_t storedLockSec = EEPROM.read(EEPROM_AUTOLOCK_SEC_ADDR);
    autoLockSeconds = (storedLockSec >= 15 && storedLockSec <= 300) ? storedLockSec : 60;

    wishTarget.armed  = (EEPROM.read(EEPROM_WISH_ARMED_ADDR) == 1);
    wishTarget.year   = (EEPROM.read(EEPROM_WISH_DATE_ADDR) << 8) | EEPROM.read(EEPROM_WISH_DATE_ADDR + 1);
    wishTarget.month  = EEPROM.read(EEPROM_WISH_DATE_ADDR + 2);
    wishTarget.day    = EEPROM.read(EEPROM_WISH_DATE_ADDR + 3);
    wishTarget.hour   = EEPROM.read(EEPROM_WISH_DATE_ADDR + 4);
    wishTarget.minute = EEPROM.read(EEPROM_WISH_DATE_ADDR + 5);

    for (int i = 0; i < 63; i++) {
      scheduledSmsText[i] = EEPROM.read(EEPROM_WISH_TEXT_ADDR + i);
    }
    scheduledSmsText[63] = '\0';
    if (strlen(scheduledSmsText) == 0) {
      strcpy(scheduledSmsText, "Happy Birthday!");
    }

    uint8_t storedMorning = EEPROM.read(EEPROM_GOOD_MORNING_EN_ADDR);
    goodMorningEnabled = (storedMorning != 0);

    uint8_t storedNight = EEPROM.read(EEPROM_GOOD_NIGHT_EN_ADDR);
    goodNightEnabled = (storedNight != 0);
  } else {
    strncpy(target_ssid, "Airfiber-3rdFloorBachelor", sizeof(target_ssid));
    strncpy(target_password, "Airfiber-3rdfloor", sizeof(target_password));
    userBrightness = 255;
    autoDimEnabled = false;
    autoLockEnabled = true;
    autoLockSeconds = 60;
    wishTarget.armed = false;
    strcpy(scheduledSmsText, "Happy Birthday!");
    goodMorningEnabled = true;
    goodNightEnabled = true;
  }
}

void saveSettings(const String& newSSID, const String& newPass, uint8_t newBright, bool newDim, bool newLockEn, uint16_t newLockSec, bool newMorning, bool newNight) {
  EEPROM.write(0, EEPROM_MAGIC);
  for (int i = 0; i < 32; i++) EEPROM.write(1 + i, i < (int)newSSID.length() ? newSSID[i] : 0);
  for (int i = 0; i < 64; i++) EEPROM.write(33 + i, i < (int)newPass.length() ? newPass[i] : 0);
  EEPROM.write(EEPROM_BRIGHT_ADDR, newBright);
  EEPROM.write(EEPROM_AUTODIM_ADDR, newDim ? 1 : 0);
  EEPROM.write(EEPROM_AUTOLOCK_EN_ADDR, newLockEn ? 1 : 0);
  EEPROM.write(EEPROM_AUTOLOCK_SEC_ADDR, (uint8_t)newLockSec);
  EEPROM.write(EEPROM_GOOD_MORNING_EN_ADDR, newMorning ? 1 : 0);
  EEPROM.write(EEPROM_GOOD_NIGHT_EN_ADDR, newNight ? 1 : 0);
  EEPROM.commit();

  newSSID.toCharArray(target_ssid, sizeof(target_ssid));
  newPass.toCharArray(target_password, sizeof(target_password));
  userBrightness = newBright;
  autoDimEnabled = newDim;
  autoLockEnabled = newLockEn;
  autoLockSeconds = newLockSec;
  goodMorningEnabled = newMorning;
  goodNightEnabled = newNight;
}

void saveAutoLockState(bool enabled) {
  EEPROM.write(EEPROM_AUTOLOCK_EN_ADDR, enabled ? 1 : 0);
  EEPROM.commit();
  autoLockEnabled = enabled;
}

void armCalendarWish(uint16_t y, uint8_t m, uint8_t d, uint8_t hr, uint8_t mn, const String& text) {
  wishTarget.year   = y;
  wishTarget.month  = m;
  wishTarget.day    = d;
  wishTarget.hour   = hr;
  wishTarget.minute = mn;
  wishTarget.armed  = true;

  EEPROM.write(EEPROM_WISH_ARMED_ADDR, 1);
  EEPROM.write(EEPROM_WISH_DATE_ADDR,     (y >> 8) & 0xFF);
  EEPROM.write(EEPROM_WISH_DATE_ADDR + 1, y & 0xFF);
  EEPROM.write(EEPROM_WISH_DATE_ADDR + 2, m);
  EEPROM.write(EEPROM_WISH_DATE_ADDR + 3, d);
  EEPROM.write(EEPROM_WISH_DATE_ADDR + 4, hr);
  EEPROM.write(EEPROM_WISH_DATE_ADDR + 5, mn);

  text.toCharArray(scheduledSmsText, sizeof(scheduledSmsText));
  for (int i = 0; i < 63; i++) {
    EEPROM.write(EEPROM_WISH_TEXT_ADDR + i, i < (int)text.length() ? text[i] : 0);
  }
  EEPROM.write(EEPROM_WISH_TEXT_ADDR + 63, 0);
  EEPROM.commit();
}

void clearScheduledWish() {
  wishTarget.armed = false;
  EEPROM.write(EEPROM_WISH_ARMED_ADDR, 0);
  EEPROM.commit();
}

void registerTarget(uint8_t* mac, int rssi) {
  int targetIndex = -1;
  for (int i = 0; i < MAX_TARGETS; i++) {
    if (targets[i].active && memcmp(targets[i].mac, mac, 6) == 0) {
      targetIndex = i;
      break;
    }
  }
  if (targetIndex == -1) {
    for (int i = 0; i < MAX_TARGETS; i++) {
      if (!targets[i].active) {
        targetIndex = i;
        break;
      }
    }
  }
  if (targetIndex == -1) targetIndex = random(0, MAX_TARGETS);

  memcpy(targets[targetIndex].mac, mac, 6);
  targets[targetIndex].rssi = rssi;
  targets[targetIndex].lastSeen = millis();
  if (!targets[targetIndex].active) targets[targetIndex].angle = random(0, 360) * (PI / 180.0);
  targets[targetIndex].active = true;

  triggerLedAlert();
  if (isDeviceLocked) setEmotion(EMO_SUSPICIOUS);
}

void snifferCallback(uint8_t *buf, uint16_t len) {
  if (len == 12) return;
  struct SnifferPacket *sniffer = (struct SnifferPacket*) buf;
  if (sniffer->buf[0] == 0x40) {
    registerTarget(&sniffer->buf[10], sniffer->rx_ctrl.rssi);
  }
}

void triggerWifiScan() {
  scanningInProgress = true;
  WiFi.scanNetworksAsync([](int networksFound) {
    totalNetworksFound = networksFound;
    scanningInProgress = false;
  });
}

void handleRoot() {
  if (currentMode == MODE_AP_CONFIG) {
    WiFi.mode(WIFI_AP_STA);
    int n = WiFi.scanNetworks();

    String html = "<!DOCTYPE html><html><head><meta name='viewport' content='width=device-width, initial-scale=1'>";
    html += "<style>body{font-family:Arial,sans-serif;background:#121212;color:#eee;text-align:center;padding:20px;}";
    html += "form{background:#1f1f1f;padding:22px;border-radius:12px;display:inline-block;max-width:340px;width:100%;box-sizing:border-box;}";
    html += "select,input[type=password],input[type=text],input[type=datetime-local]{width:100%;padding:10px;margin:8px 0 16px 0;border-radius:6px;border:1px solid #333;background:#2a2a2a;color:#fff;box-sizing:border-box;}";
    html += ".slider-container{margin:15px 0 10px 0;text-align:left;}";
    html += ".toggle-container{margin:12px 0;text-align:left;display:flex;align-items:center;}";
    html += "input[type=range]{width:100%;margin:10px 0;accent-color:#00bcd4;cursor:pointer;}";
    html += "input[type=checkbox]{width:18px;height:18px;margin-right:10px;accent-color:#00bcd4;cursor:pointer;}";
    html += "input[type=submit]{width:100%;background:#00bcd4;color:#fff;padding:12px;border:none;border-radius:6px;font-weight:bold;font-size:16px;cursor:pointer;margin-top:12px;}";
    html += "label{font-size:14px;color:#aaa;display:block;text-align:left;font-weight:bold;}";
    html += ".val-badge{float:right;color:#00bcd4;font-size:14px;}";
    html += "hr{border:0;border-top:1px solid #333;margin:20px 0;}";
    html += "</style></head><body><h2>COCO Setup</h2>";
    html += "<form method='POST' action='/save'>";
    html += "<label>Select Nearby Wi-Fi:</label><select name='ssid'>";

    if (n == 0) {
      html += "<option value=''>No networks found</option>";
    } else {
      for (int i = 0; i < n; ++i) {
        String s = WiFi.SSID(i);
        s.trim();
        if (s.length() > 0) {
          String selected = (s == String(target_ssid)) ? " selected" : "";
          html += "<option value='" + s + "'" + selected + ">" + s + " (" + String(WiFi.RSSI(i)) + " dBm)</option>";
        }
      }
    }

    html += "</select><label>Password:</label>";
    html += "<input type='password' name='pass' value='" + String(target_password) + "'><br>";

    // Manual Brightness Slider
    html += "<div class='slider-container'>";
    html += "<label>Manual Brightness: <span id='bVal' class='val-badge'>" + String(userBrightness) + "</span></label>";
    html += "<input type='range' name='bright' min='1' max='255' value='" + String(userBrightness) + "' oninput=\"document.getElementById('bVal').innerText=this.value;\">";
    html += "</div>";

