Debjit230/ESP8266-EXPERIMENT/src/main.cpp
    // Auto-Dim Toggle
    html += "<div class='toggle-container'>";
    html += "<input type='checkbox' id='autodim' name='autodim' value='1'" + String(autoDimEnabled ? " checked" : "") + ">";
    html += "<label for='autodim' style='font-size:13px;cursor:pointer;color:#eee;'>Auto-dim on Lock / Clock</label>";
    html += "</div>";

    // Auto-Lock Toggle
    html += "<div class='toggle-container'>";
    html += "<input type='checkbox' id='autolock' name='autolock' value='1'" + String(autoLockEnabled ? " checked" : "") + ">";
    html += "<label for='autolock' style='font-size:13px;cursor:pointer;color:#eee;'>Enable Auto-Lock (EMO Face)</label>";
    html += "</div>";

    // Auto-Lock Seconds Slider
    html += "<div class='slider-container'>";
    html += "<label>Lock Timeout (sec): <span id='lVal' class='val-badge'>" + String(autoLockSeconds) + "s</span></label>";
    html += "<input type='range' name='locksec' min='15' max='300' step='5' value='" + String(autoLockSeconds) + "' oninput=\"document.getElementById('lVal').innerText=this.value+'s';\">";
    html += "</div>";

    // Daily Routines Section
    html += "<hr><h3 style='margin:10px 0;color:#00bcd4;'>Daily Messages</h3>";
    html += "<div class='toggle-container'>";
    html += "<input type='checkbox' id='gmorning' name='gmorning' value='1'" + String(goodMorningEnabled ? " checked" : "") + ">";
    html += "<label for='gmorning' style='font-size:13px;cursor:pointer;color:#eee;'>Good Morning at 7:00 AM</label>";
    html += "</div>";

    html += "<div class='toggle-container'>";
    html += "<input type='checkbox' id='gnight' name='gnight' value='1'" + String(goodNightEnabled ? " checked" : "") + ">";
    html += "<label for='gnight' style='font-size:13px;cursor:pointer;color:#eee;'>Good Night at 10:30 PM</label>";
    html += "</div>";

    // Birthday Wish Schedule
    html += "<hr><h3 style='margin:10px 0;color:#00bcd4;'>Match Clock & Wish</h3>";
    html += "<label>Wish Message:</label>";
    html += "<input type='text' name='smstext' maxlength='60' placeholder='Happy Birthday Ankita!' value=''>";
    html += "<label>Set Target Date & Time:</label>";
    html += "<input type='datetime-local' name='smstime'>";

    if (wishTarget.armed) {
      char buf[32];
      snprintf(buf, sizeof(buf), "%02d-%02d-%04d %02d:%02d", wishTarget.day, wishTarget.month, wishTarget.year, wishTarget.hour, wishTarget.minute);
      html += "<p style='font-size:13px;color:#00bcd4;margin:4px 0 12px 0;'>Countdown armed for: " + String(buf) + "</p>";
    }

    html += "<input type='submit' value='Save & Apply'></form></body></html>";
    server.send(200, "text/html", html);
  } else {
    server.send(200, "text/plain", "COCO Ready");
  }
}

void handleConfigSave() {
  String reqSSID     = server.arg("ssid");
  String reqPass     = server.arg("pass");
  String reqBright   = server.arg("bright");
  bool reqAutoDim    = server.hasArg("autodim");
  bool reqAutoLock   = server.hasArg("autolock");
  String reqLockSec  = server.arg("locksec");
  bool reqMorning    = server.hasArg("gmorning");
  bool reqNight      = server.hasArg("gnight");
  String reqSmsText  = server.arg("smstext");
  String reqSmsTime  = server.arg("smstime");

  uint8_t newBright = userBrightness;
  if (reqBright.length() > 0) {
    int b = reqBright.toInt();
    if (b >= 1 && b <= 255) newBright = (uint8_t)b;
  }

  uint16_t newLockSec = autoLockSeconds;
  if (reqLockSec.length() > 0) {
    int ls = reqLockSec.toInt();
    if (ls >= 15 && ls <= 300) newLockSec = (uint16_t)ls;
  }

  if (reqSmsTime.length() >= 16) {
    uint16_t y  = reqSmsTime.substring(0, 4).toInt();
    uint8_t  m  = reqSmsTime.substring(5, 7).toInt();
    uint8_t  d  = reqSmsTime.substring(8, 10).toInt();
    uint8_t  hr = reqSmsTime.substring(11, 13).toInt();
    uint8_t  mn = reqSmsTime.substring(14, 16).toInt();

    String textToSave = (reqSmsText.length() > 0) ? reqSmsText : "Happy Birthday!";
    armCalendarWish(y, m, d, hr, mn, textToSave);
  }

  if (reqSSID.length() > 0) {
    saveSettings(reqSSID, reqPass, newBright, reqAutoDim, reqAutoLock, newLockSec, reqMorning, reqNight);
    setOledBrightness(newBright);

    String html = "<html><body style='background:#121212;color:#eee;text-align:center;padding:40px;font-family:Arial;'>";
    html += "<h2>Settings Saved!</h2><p>Rebooting...</p></body></html>";
    server.send(200, "text/html", html);
    delay(1500);
    ESP.restart();
  } else {
    server.send(400, "text/plain", "SSID cannot be empty.");
  }
}

void configureMode(DeviceMode newMode) {
  currentMode = newMode;
  display.clearDisplay();
  setOledBrightness(userBrightness);

  server.stop();
  wifi_promiscuous_enable(0);
  irrecv.disableIRIn();
  shutoffLeds();
  alertLedActive = false;

  switch (currentMode) {
    case MODE_RADAR:
      WiFi.persistent(false);
      WiFi.disconnect();
      WiFi.mode(WIFI_STA);
      wifi_set_opmode(STATION_MODE);
      wifi_promiscuous_enable(0);
      wifi_set_promiscuous_rx_cb(snifferCallback);
      wifi_promiscuous_enable(1);
      break;

    case MODE_SCANNER:
      WiFi.mode(WIFI_STA);
      WiFi.disconnect();
      totalNetworksFound = 0;
      triggerWifiScan();
      lastScanTime = millis();
      break;

    case MODE_RF_TRIPWIRE:
      WiFi.mode(WIFI_STA);
      WiFi.setSleepMode(WIFI_NONE_SLEEP);
      WiFi.begin(target_ssid, target_password);
      baselineInitialized = false;
      isCalibrating = false;
      calibrationStartTime = 0;
      maxNoiseObserved = 0.0;
      for (int i = 0; i < WAVE_POINTS; i++) waveBuffer[i] = 42;
      break;

    case MODE_IR_DECODER:
      WiFi.disconnect();
      WiFi.mode(WIFI_OFF);
      irrecv.setUnknownThreshold(12);
      irrecv.enableIRIn();
      break;

    case MODE_AP_CONFIG: {
      WiFi.persistent(false);
      WiFi.disconnect(true);
      delay(50);
      WiFi.mode(WIFI_AP_STA);

      IPAddress local_ip(192, 168, 4, 1);
      IPAddress gateway(192, 168, 4, 1);
      IPAddress subnet(255, 255, 255, 0);
      WiFi.softAPConfig(local_ip, gateway, subnet);
      WiFi.softAP(AP_CONFIG_SSID, AP_CONFIG_PASS, 1, 0, 4);

      server.begin();
      break;
    }
  }
}

void enterLockScreen() {
  isDeviceLocked = true;
  isClockModeActive = false;
  isPeekClockActive = false;
  resumeMode = currentMode;

