Debjit230/ESP8266-EXPERIMENT/src/main.cpp
  shutoffLeds();
  alertLedActive = false;

  if (autoDimEnabled) {
    uint8_t dimLevel = map(userBrightness, 1, 255, 1, 35);
    setOledBrightness(dimLevel);
  } else {
    setOledBrightness(userBrightness);
  }

  if (isNightWindow()) {
    currentEmotion = EMO_SLEEP;
  } else {
    currentEmotion = EMO_NORMAL;
  }

  display.clearDisplay();
  display.display();
}

void unlockDevice() {
  isDeviceLocked = false;
  isPeekClockActive = false;
  isSmsAlertActive = false;
  lastUserActivity = millis();

  setOledBrightness(userBrightness);
  display.clearDisplay();
  configureMode(resumeMode);
}

void drawDeskBuddyEye(int x, int y, int w, int h, int pupilShiftX, int pupilShiftY) {
  if (h <= 4) {
    display.fillRoundRect(x, y + 13, w, 4, 2, SSD1306_WHITE);
    return;
  }

  int cornerRadius = 9;
  if (h < 18) cornerRadius = h / 2;

  display.fillRoundRect(x, y, w, h, cornerRadius, SSD1306_WHITE);

  int pupilW = 10;
  int pupilH = (h > 16) ? 10 : (h - 6);
  if (pupilH < 3) pupilH = 3;

  int pupilCenterX = x + (w / 2) + pupilShiftX;
  int pupilCenterY = y + (h / 2) + pupilShiftY;

  display.fillRoundRect(pupilCenterX - (pupilW / 2), pupilCenterY - (pupilH / 2), pupilW, pupilH, 3, SSD1306_BLACK);
}

void drawHappyArchedEye(int x, int y, int w) {
  display.fillRoundRect(x, y, w, 18, 9, SSD1306_WHITE);
  display.fillRoundRect(x, y + 6, w, 18, 9, SSD1306_BLACK);
}

void drawSmallHeart(int x, int y, int size) {
  if (size <= 2) {
    display.fillCircle(x - 2, y, 2, SSD1306_WHITE);
    display.fillCircle(x + 2, y, 2, SSD1306_WHITE);
    display.fillTriangle(x - 4, y, x + 4, y, x, y + 5, SSD1306_WHITE);
  } else {
    display.fillCircle(x - 3, y - 1, 3, SSD1306_WHITE);
    display.fillCircle(x + 3, y - 1, 3, SSD1306_WHITE);
    display.fillTriangle(x - 6, y, x + 6, y, x, y + 8, SSD1306_WHITE);
  }
}

void drawAutoLockBanner() {
  display.clearDisplay();
  display.drawRoundRect(10, 14, 108, 36, 6, SSD1306_WHITE);
  display.setTextSize(1);
  display.setTextColor(SSD1306_WHITE);
  display.setCursor(24, 20);
  display.print("AUTO-LOCK:");
  display.setTextSize(2);
  display.setCursor(44, 32);
  display.print(autoLockEnabled ? "ON" : "OFF");
  display.display();
}

// 30-second celebration sequence alternating marquee text with context-aware face
void drawBirthdayWishUI() {
  unsigned long now = millis();
  unsigned long elapsed = now - smsAlertStartTime;

  unsigned long cycleTime = elapsed % 7000;

  if (cycleTime >= 4500) {
    display.clearDisplay();

    if (activeAlertType == 2) {
      display.fillRoundRect(24, 31, 30, 14, 7, SSD1306_WHITE);
      display.fillRect(24, 31, 30, 7, SSD1306_BLACK);
      display.fillRoundRect(74, 31, 30, 14, 7, SSD1306_WHITE);
      display.fillRect(74, 31, 30, 7, SSD1306_BLACK);

      int zPos = (now / 350) % 4;
      display.setTextSize(1);
      display.setTextColor(SSD1306_WHITE);
      if (zPos >= 1) { display.setCursor(98, 22); display.print("z"); }
      if (zPos >= 2) { display.setCursor(106, 14); display.print("Z"); }
      if (zPos >= 3) { display.setCursor(114, 6);  display.print("Z"); }
    } else {
      int heartY = 19 + (int)(sin(now * 0.012) * 3.0);
      int heartScale = ((now / 200) % 2 == 0) ? 3 : 2;

      drawHappyArchedEye(24, 21, 30);
      drawHappyArchedEye(74, 21, 30);
      drawSmallHeart(64, heartY, heartScale);
    }
    display.display();
  } else {
    const char* renderStr;
    if (activeAlertType == 1) {
      renderStr = "Good Morning!";
    } else if (activeAlertType == 2) {
      renderStr = "Good Night & Sweet Dreams!";
    } else {
      renderStr = (scheduledSmsText[0] != '\0') ? scheduledSmsText : "Happy Birthday!";
    }

    int textPixelWidth = strlen(renderStr) * 12;

    if (now - lastMarqueeShift >= 25) {
      lastMarqueeShift = now;
      marqueeScrollX -= 3;
      if (marqueeScrollX < -textPixelWidth) {
        marqueeScrollX = SCREEN_WIDTH;
      }
    }

    display.clearDisplay();
    display.setTextSize(2);
    display.setTextWrap(false);
    display.setTextColor(SSD1306_WHITE);
    display.setCursor(marqueeScrollX, 24);
    display.print(renderStr);
    display.display();
  }
}

// Checks Clock for Birthday Wishes & Daily Routines (7:00 AM & 10:30 PM)
void checkScheduledSms() {
  if (isSmsAlertActive) return;

  time_t now = time(nullptr);
  if (now < 100000) return;

  struct tm* t = localtime(&now);

  // 1. Daily Good Morning Check (07:00 AM)
  if (goodMorningEnabled && t->tm_hour == 7 && t->tm_min == 0) {
    if (lastMorningTriggerDay != t->tm_mday) {
      lastMorningTriggerDay = t->tm_mday;
      activeAlertType = 1;
      isSmsAlertActive = true;
      smsAlertStartTime = millis();
      marqueeScrollX = SCREEN_WIDTH;
      setOledBrightness(userBrightness);
      return;
    }
  }

  // 2. Daily Good Night Check (10:30 PM = 22:30)
  if (goodNightEnabled && t->tm_hour == 22 && t->tm_min == 30) {
    if (lastNightTriggerDay != t->tm_mday) {
      lastNightTriggerDay = t->tm_mday;
      activeAlertType = 2;
      isSmsAlertActive = true;
      smsAlertStartTime = millis();
      marqueeScrollX = SCREEN_WIDTH;
      setOledBrightness(userBrightness);
      return;
    }
  }

  // 3. Custom Scheduled Calendar Wish Check
  if (wishTarget.armed) {
    if ((t->tm_year + 1900) == (int)wishTarget.year &&
        (t->tm_mon + 1)     == (int)wishTarget.month &&
        t->tm_mday          == (int)wishTarget.day &&
        t->tm_hour          == (int)wishTarget.hour &&
        t->tm_min           == (int)wishTarget.minute) {
      
      activeAlertType = 0;
      isSmsAlertActive = true;
      smsAlertStartTime = millis();
      marqueeScrollX = SCREEN_WIDTH;
      setOledBrightness(userBrightness);
      clearScheduledWish();
    }
  }
}

// Living Animated Desk-Buddy Face
void drawEmoFace() {
  unsigned long now = millis();

  if (currentEmotion != EMO_NORMAL && currentEmotion != EMO_SLEEP && currentEmotion != EMO_LOVE) {
    if (now - emotionHoldStartTime > EMOTION_HOLD_MS) {
      currentEmotion = isNightWindow() ? EMO_SLEEP : EMO_NORMAL;
    }
  }

  display.clearDisplay();

