Debjit230/ESP8266-EXPERIMENT/src/main.cpp
  const int eyeW = 30;
  const int leftEyeBaseX = 24;
  const int rightEyeBaseX = 74;
  const int eyeBaseY = 17;

  if (currentEmotion == EMO_LOVE) {
    int heartY = 19 + (int)(sin(now * 0.012) * 3.0);
    int heartScale = ((now / 200) % 2 == 0) ? 3 : 2;

    drawHappyArchedEye(leftEyeBaseX, eyeBaseY + 4, eyeW);
    drawHappyArchedEye(rightEyeBaseX, eyeBaseY + 4, eyeW);
    drawSmallHeart(64, heartY, heartScale);
    display.display();
    return;
  }

  if (currentEmotion == EMO_SLEEP) {
    display.fillRoundRect(leftEyeBaseX, eyeBaseY + 14, eyeW, 14, 7, SSD1306_WHITE);
    display.fillRect(leftEyeBaseX, eyeBaseY + 14, eyeW, 7, SSD1306_BLACK);
    display.fillRoundRect(rightEyeBaseX, eyeBaseY + 14, eyeW, 14, 7, SSD1306_WHITE);
    display.fillRect(rightEyeBaseX, eyeBaseY + 14, eyeW, 7, SSD1306_BLACK);

    if (now - lastZzzAnim > 350) {
      lastZzzAnim = now;
      zzzStep = (zzzStep + 1) % 4;
    }
    display.setTextSize(1);
    display.setTextColor(SSD1306_WHITE);
    if (zzzStep >= 1) { display.setCursor(98, 22); display.print("z"); }
    if (zzzStep >= 2) { display.setCursor(106, 14); display.print("Z"); }
    if (zzzStep >= 3) { display.setCursor(114, 6);  display.print("Z"); }

    display.display();
    return;
  }

  if (currentEmotion == EMO_SHOCKED) {
    int lx = leftEyeBaseX + 15;
    int rx = rightEyeBaseX + 15;
    int cy = eyeBaseY + 15;
    display.fillCircle(lx, cy, 18, SSD1306_WHITE);
    display.fillCircle(rx, cy, 18, SSD1306_WHITE);
    display.fillCircle(lx, cy, 6, SSD1306_BLACK);
    display.fillCircle(rx, cy, 6, SSD1306_BLACK);
    display.display();
    return;
  }

  if (currentEmotion == EMO_SUSPICIOUS) {
    display.fillRoundRect(leftEyeBaseX, eyeBaseY + 8, eyeW, 16, 4, SSD1306_WHITE);
    display.fillRoundRect(rightEyeBaseX, eyeBaseY + 8, eyeW, 16, 4, SSD1306_WHITE);
    display.fillTriangle(leftEyeBaseX, eyeBaseY + 8, leftEyeBaseX + eyeW, eyeBaseY + 8, leftEyeBaseX + eyeW, eyeBaseY + 14, SSD1306_BLACK);
    display.fillTriangle(rightEyeBaseX, eyeBaseY + 8, rightEyeBaseX + eyeW, eyeBaseY + 8, rightEyeBaseX, eyeBaseY + 14, SSD1306_BLACK);
    display.fillRect(leftEyeBaseX + 10, eyeBaseY + 12, 10, 8, SSD1306_BLACK);
    display.fillRect(rightEyeBaseX + 10, eyeBaseY + 12, 10, 8, SSD1306_BLACK);
    display.display();
    return;
  }

  if (currentEmotion == EMO_WINK) {
    drawDeskBuddyEye(leftEyeBaseX, eyeBaseY, eyeW, 30, 0, 0);
    display.fillRoundRect(rightEyeBaseX, eyeBaseY + 14, eyeW, 4, 2, SSD1306_WHITE);
    display.display();
    return;
  }

  if (!isBlinking && (now - lastEyeTargetShift > (unsigned long)random(2200, 4200))) {
    lastEyeTargetShift = now;
    if (random(0, 100) < 35) {
      isBlinking = true;
      blinkStartTime = now;
      targetEyeH = 4.0;
    } else {
      targetEyeX = random(-7, 8);
      targetEyeY = random(-4, 5);
    }
  }

  if (isBlinking && (now - blinkStartTime > 130)) {
    isBlinking = false;
    targetEyeH = 30.0;
  }

  currentEyeX += (targetEyeX - currentEyeX) * 0.25;
  currentEyeY += (targetEyeY - currentEyeY) * 0.25;
  currentEyeH += (targetEyeH - currentEyeH) * 0.35;

  int renderH = constrain((int)currentEyeH, 4, 30);
  int lx = constrain(leftEyeBaseX + (int)currentEyeX, 4, 46);
  int rx = constrain(rightEyeBaseX + (int)currentEyeX, 54, 96);
  int y  = constrain(eyeBaseY + (int)currentEyeY + (30 - renderH) / 2, 6, 32);

  int pupilOffsetX = constrain((int)(currentEyeX * 0.5), -4, 4);
  int pupilOffsetY = constrain((int)(currentEyeY * 0.5), -3, 3);

  drawDeskBuddyEye(lx, y, eyeW, renderH, pupilOffsetX, pupilOffsetY);
  drawDeskBuddyEye(rx, y, eyeW, renderH, pupilOffsetX, pupilOffsetY);

  display.display();
}

void drawClockUI() {
  time_t now = time(nullptr);
  struct tm* timeinfo = localtime(&now);

  display.clearDisplay();
  display.setTextColor(SSD1306_WHITE);

  char timeStr[10];
  int hour12 = timeinfo->tm_hour % 12;
  if (hour12 == 0) hour12 = 12;
  const char* ampm = (timeinfo->tm_hour >= 12) ? "PM" : "AM";

  snprintf(timeStr, sizeof(timeStr), "%02d:%02d:%02d", hour12, timeinfo->tm_min, timeinfo->tm_sec);

  display.setTextSize(2);
  display.setCursor(4, 14);
  display.print(timeStr);

  display.setTextSize(1);
  display.setCursor(104, 20);
  display.print(ampm);

  const char* days[] = {"Sun", "Mon", "Tue", "Wed", "Thu", "Fri", "Sat"};
  const char* months[] = {"Jan", "Feb", "Mar", "Apr", "May", "Jun", "Jul", "Aug", "Sep", "Oct", "Nov", "Dec"};

  display.setTextSize(1);
  display.setCursor(6, 40);
  display.printf("%s, %02d %s %04d", 
                 days[timeinfo->tm_wday], 
                 timeinfo->tm_mday, 
                 months[timeinfo->tm_mon], 
                 timeinfo->tm_year + 1900);

  display.display();
}

void drawConfigUI() {
  display.clearDisplay();
  display.setTextColor(SSD1306_WHITE);
  display.setTextSize(1);

  display.setCursor(0, 0);
  display.println("--- AP CONFIG ---");
  display.drawLine(0, 9, 127, 9, SSD1306_WHITE);

  display.setCursor(0, 13);
  display.println("SSID: COCO-Desk-Buddy");
  display.setCursor(0, 24);
  display.println("Pass: 12345678");

  display.setCursor(0, 36);
  display.printf("Bright: %d/255\n", userBrightness);
  display.setCursor(0, 46);
  display.printf("AutoLock: %s (%ds)\n", autoLockEnabled ? "ON" : "OFF", autoLockSeconds);

  display.setCursor(0, 56);
  display.println("http://192.168.4.1");

  display.display();
}

void drawRadarUI() {
  display.clearDisplay();

  const int centerX = 40;
  const int centerY = 32;
  const int maxRadius = 30;

  display.drawCircle(centerX, centerY, 10, SSD1306_WHITE);
  display.drawCircle(centerX, centerY, 20, SSD1306_WHITE);
  display.drawCircle(centerX, centerY, maxRadius, SSD1306_WHITE);
  display.drawLine(centerX - maxRadius, centerY, centerX + maxRadius, centerY, SSD1306_WHITE);
  display.drawLine(centerX, centerY - maxRadius, centerX, centerY + maxRadius, SSD1306_WHITE);

  int sweepX = centerX + cos(sweepAngle) * maxRadius;
  int sweepY = centerY + sin(sweepAngle) * maxRadius;
  display.drawLine(centerX, centerY, sweepX, sweepY, SSD1306_WHITE);

  int activeCount = 0;
  int closestRSSI = -100;

  for (int i = 0; i < MAX_TARGETS; i++) {
    if (targets[i].active) {
      if (millis() - targets[i].lastSeen > 6000) {
        targets[i].active = false;
        continue;
      }
      activeCount++;
      if (targets[i].rssi > closestRSSI) {
        closestRSSI = targets[i].rssi;
      }

      int dist = map(targets[i].rssi, -95, -35, maxRadius - 2, 4);
      dist = constrain(dist, 4, maxRadius - 2);

      int tx = centerX + cos(targets[i].angle) * dist;
      int ty = centerY + sin(targets[i].angle) * dist;
      display.fillRect(tx - 1, ty - 1, 3, 3, SSD1306_WHITE);
    }
  }

