Debjit230/ESP8266-EXPERIMENT/src/main.cpp
  display.setTextSize(1);
  display.setTextColor(SSD1306_WHITE);
  display.setCursor(76, 4);
  display.print("RADAR");
  display.setCursor(76, 18);
  display.printf("CH: %2d", currentChannel);
  display.setCursor(76, 32);
  display.printf("TGT: %d", activeCount);
  display.setCursor(76, 46);
  if (activeCount > 0) {
    display.printf("%ddBm", closestRSSI);
  } else {
    display.print("SWEEP");
  }

  display.display();
}

void drawScannerUI() {
  display.clearDisplay();
  display.setTextColor(SSD1306_WHITE);
  display.setTextSize(1);

  display.setCursor(0, 0);
  display.printf("NETWORKS FOUND: %d", totalNetworksFound);
  display.drawLine(0, 9, 127, 9, SSD1306_WHITE);

  int yPos = 12;
  int displayedCount = 0;

  for (int i = 0; i < totalNetworksFound && displayedCount < 4; i++) {
    String ssidName = WiFi.SSID(i);
    ssidName.trim();
    if (ssidName.length() == 0) continue;
    if (ssidName.length() > 11) ssidName = ssidName.substring(0, 11);

    display.setCursor(0, yPos);
    display.printf("%-11s %2ddB", ssidName.c_str(), WiFi.RSSI(i));
    yPos += 11;
    displayedCount++;
  }

  if (displayedCount == 0) {
    display.setCursor(0, 24);
    display.println(scanningInProgress ? "Scanning..." : "No visible APs");
  }

  display.setCursor(0, 56);
  display.print(scanningInProgress ? "Status: Scanning..." : "Status: Active");

  display.display();
}

void drawTripwireUI(float delta, int currentRssi, bool motionAlert) {
  display.clearDisplay();
  display.setTextColor(SSD1306_WHITE);
  display.setTextSize(1);

  display.setCursor(0, 0);
  display.printf("TRIPWIRE: %2ddBm", currentRssi);
  display.drawLine(0, 9, 127, 9, SSD1306_WHITE);

  if (motionAlert) {
    display.fillRect(0, 11, 128, 10, SSD1306_WHITE);
    display.setTextColor(SSD1306_BLACK);
    display.setCursor(18, 12);
    display.print("** MOTION ALERT **");
    display.setTextColor(SSD1306_WHITE);
  } else {
    display.setCursor(0, 12);
    display.printf("D:%.1f TH:%.1f", delta, dynamicThreshold);
  }

  display.drawFastHLine(0, 42, 128, SSD1306_WHITE);

  for (int x = 0; x < WAVE_POINTS - 1; x++) {
    int idx1 = (waveIndex + x) % WAVE_POINTS;
    int idx2 = (waveIndex + x + 1) % WAVE_POINTS;
    display.drawLine(x, waveBuffer[idx1], x + 1, waveBuffer[idx2], SSD1306_WHITE);
  }

  display.display();
}

void drawDecoderUI() {
  display.clearDisplay();
  display.setTextColor(SSD1306_WHITE);
  display.setTextSize(1);

  display.setCursor(0, 0);
  display.println("--- IR DECODER ---");

  display.setCursor(0, 16);
  display.print("Proto: ");
  display.println(lastProtocol);

  display.setCursor(0, 28);
  display.print("Code : ");
  display.println(lastHexCode);

  display.setCursor(0, 40);
  display.printf("Bits : %d-bit\n", lastBits);

  display.setCursor(0, 54);
  display.print("TSOP Receiver: Ready");

  display.display();
}

// Startup connection routine: Clean display showing COCO, SSID, and Time Sync
void syncTimeAtStartup() {
  shutoffLeds();

  display.clearDisplay();
  display.setTextColor(SSD1306_WHITE);
  display.setTextSize(2);
  display.setCursor(40, 2);
  display.print("COCO");
  display.drawFastHLine(14, 20, 100, SSD1306_WHITE);

  display.setTextSize(1);
  display.setCursor(0, 26);
  display.print("Connecting to AP:");
  display.setCursor(0, 38);
  display.print(target_ssid[0] ? target_ssid : "[NO SSID SET]");
  display.display();

  if (!target_ssid[0]) {
    delay(1500);
    return;
  }

  WiFi.mode(WIFI_STA);
  WiFi.begin(target_ssid, target_password);

  unsigned long start = millis();
  int dotCount = 0;
  while (WiFi.status() != WL_CONNECTED && millis() - start < 8000) {
    if (digitalRead(BUTTON_PIN) == LOW) {
      configureMode(MODE_AP_CONFIG);
      return;
    }

    display.fillRect(0, 50, 128, 12, SSD1306_BLACK);
    display.setCursor(0, 50);
    display.print("Connecting");
    for (int i = 0; i < dotCount; i++) display.print(".");
    display.display();

    dotCount = (dotCount + 1) % 4;
    delay(250);
  }

  if (WiFi.status() == WL_CONNECTED) {
    display.clearDisplay();
    display.setTextSize(2);
    display.setCursor(40, 2);
    display.print("COCO");
    display.drawFastHLine(14, 20, 100, SSD1306_WHITE);

    display.setTextSize(1);
    display.setCursor(0, 26);
    display.print("Wi-Fi Connected!");
    display.setCursor(0, 38);
    display.print("Setting Date & Time...");
    display.display();

    configTime(gmtOffset_sec, daylightOffset_sec, ntpServer);

    time_t now = time(nullptr);
    start = millis();
    while (now < 100000 && millis() - start < 4000) {
      delay(150);
      now = time(nullptr);
    }

    if (now >= 100000) {
      struct tm* t = localtime(&now);
      display.clearDisplay();
      display.setTextSize(2);
      display.setCursor(40, 2);
      display.print("COCO");
      display.drawFastHLine(14, 20, 100, SSD1306_WHITE);

      display.setTextSize(1);
      display.setCursor(0, 28);
      display.printf("Time: %02d:%02d:%02d", t->tm_hour, t->tm_min, t->tm_sec);
      display.setCursor(0, 42);
      display.printf("Date: %02d-%02d-%04d", t->tm_mday, t->tm_mon + 1, t->tm_year + 1900);
      display.display();
      delay(1200);
    }
  } else {
    display.clearDisplay();
    display.setTextSize(2);
    display.setCursor(40, 2);
    display.print("COCO");
    display.drawFastHLine(14, 20, 100, SSD1306_WHITE);

    display.setTextSize(1);
    display.setCursor(0, 30);
    display.print("Wi-Fi Timeout!");
    display.display();
    delay(1000);
  }
}

void setup() {
  pinMode(EXTERNAL_LED, OUTPUT);
  pinMode(BOARD_LED, OUTPUT);
  pinMode(BUTTON_PIN, INPUT_PULLUP);
  pinMode(IR_RECV_PIN, INPUT_PULLUP);

  shutoffLeds();

  Serial.begin(115200);
  delay(100);

  loadCredentials();

  server.on("/", handleRoot);
  server.on("/save", HTTP_POST, handleConfigSave);

  Wire.begin(OLED_SDA, OLED_SCL);
  display.begin(SSD1306_SWITCHCAPVCC, 0x3C);
  display.setRotation(2);
  display.clearDisplay();
  display.display();

  setOledBrightness(userBrightness);

  syncTimeAtStartup();

  lastUserActivity = millis();

  // Directly enter active radar working mode
  if (currentMode != MODE_AP_CONFIG) {
    configureMode(MODE_RADAR);
  }
}

void loop() {
  unsigned long currentMillis = millis();

  // 1. Birthday / Daily Greeting Party Strobe / Normal Alert Shutoff
  if (isSmsAlertActive) {
    bool strobe = ((currentMillis / 100) % 2 == 0);
    digitalWrite(EXTERNAL_LED, strobe ? HIGH : LOW);
    digitalWrite(BOARD_LED, strobe ? LOW : HIGH);
  } else {
    if (alertLedActive && (currentMillis - alertLedStart >= LED_ALERT_DURATION)) {
      alertLedActive = false;
      shutoffLeds();
    }
  }

  // 2. Exact match check between live display clock, target schedule, and daily routines
  checkScheduledSms();

  // 3. Auto-expire Birthday / Daily Wish after 30 seconds
  if (isSmsAlertActive && (currentMillis - smsAlertStartTime >= SMS_DISPLAY_DURATION)) {
    isSmsAlertActive = false;
    shutoffLeds();
    display.clearDisplay();
  }

  // 4. Button Engine
  if (currentMillis - lastButtonCheck >= 25) {
    lastButtonCheck = currentMillis;
    bool pinState = (digitalRead(BUTTON_PIN) == LOW);

    if (pinState && !buttonIsPressed) {
      buttonIsPressed = true;
      buttonPressStartTime = currentMillis;
      holdThresholdMet = false;
    } 
    else if (pinState && buttonIsPressed) {
      unsigned long heldTime = currentMillis - buttonPressStartTime;

      if (!holdThresholdMet) {
        if (isDeviceLocked && heldTime >= 700) {
          holdThresholdMet = true;
          clickCount = 0;
          isPeekClockActive = false;
          setEmotion(EMO_LOVE);
        }
        else if (!isDeviceLocked && heldTime >= 2000) {
          holdThresholdMet = true;
          clickCount = 0;
          lastUserActivity = currentMillis;
          isClockModeActive = false;
          configureMode(MODE_AP_CONFIG);
        } 
        else if (!isDeviceLocked && heldTime >= 400) {
          display.fillRect(10, 56, (heldTime - 400) * 108 / 1600, 4, SSD1306_WHITE);
          display.display();
        }
      }
    } 
    else if (!pinState && buttonIsPressed) {
      buttonIsPressed = false;
      unsigned long duration = currentMillis - buttonPressStartTime;

      if (duration < 600 && !holdThresholdMet) {
        clickCount++;
        lastClickTime = currentMillis;

        if (isSmsAlertActive) {
          isSmsAlertActive = false;
          shutoffLeds();
          clickCount = 0;
          display.clearDisplay();
        }
        else if (clickCount == 2) {
          clickCount = 0;
          if (isDeviceLocked) {
            unlockDevice();
          } else {
            enterLockScreen();
          }
        }
        else if (clickCount >= 3) {
          clickCount = 0;
          saveAutoLockState(!autoLockEnabled);
          isBannerActive = true;
          bannerStartTime = currentMillis;
        }
      }
    }

